# Pandas Review

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
tips = sns.load_dataset('tips')
iris = sns.load_dataset('iris')

## 1. data structures

### 1.1 Series

Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.)

##### Creation: ndarray, list, dictionary, number...

In [22]:
nd = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
li = pd.Series([1,2,3,4,5], index=["a", "b", "c", "d", "e"])
di = pd.Series({'a':1, 'b':2, 'c':98})
num = pd.Series(5.0, index = ['a','b','v'])

##### Slicing
    last one: [-1]
    second last : [-2]
    middle : [start:stop]
    top to n: [:stop]
    n to end: [start:]
    last n to the end[-start:]
    start to last n [:-end]
    start to end collect skip n-1 [start:end:n]
    backward: start to end collect skip n-1 [start:end:-n]
    slice function: 
        s = slice(1, 5, 2) -> object[s]
    by multipe index: s[[x,y,z]]
    by condition: s[s>s.median]
##### Slicing Series dict like
    s[index]
    s.get()

##### Attribute
    .dtype
    .to_numpy()
    .name/rename, name can be used in (name = 'something')

### 1.2 DataFrame

##### Creation: 
    dict of Series, dicts, ndarrays,lists,tuples -> by column
    structured or record array
    list of dicts -> by row

In [12]:
df = pd.DataFrame({'A':np.random.randn(5),
              'B': [2,7,5,8,np.nan],
              'C': ('A',5,7,3,'U')})

In [13]:
df2 = pd.DataFrame([{'a':3,'b':8},{'a':3,'b':9},{'a':3,'b':9,'c':0}])

Delete column

In [ ]:
del df['A']
df.pop('B')

Insert column

In [ ]:
df.insert(1, "bar", df["one"]) #(position, column name, value, o:allow_duplicates=False)

In [21]:
tips.assign(tip_ratio = tips['tip']/tips['total_bill']).head()

   total_bill   tip     sex smoker  day    time  size  tip_ratio
0       16.99  1.01  Female     No  Sun  Dinner     2   0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3   0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3   0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2   0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4   0.146808

In [28]:
tips.assign(tip_ratio = lambda x: x.tip/x.total_bill,
            tip_size_ratio = lambda x:x.tip/x.size).head()

,total_bill,tip,sex,smoker,day,time,size,tip_ratio,tip_size_ratio
0,16.99,1.01,Female,No,Sun,Dinner,2,0.059447,0.000517
1,10.34,1.66,Male,No,Sun,Dinner,3,0.160542,0.000850
2,21.01,3.50,Male,No,Sun,Dinner,3,0.166587,0.001793
3,23.68,3.31,Male,No,Sun,Dinner,2,0.139780,0.001696
4,24.59,3.61,Female,No,Sun,Dinner,4,0.146808,0.001849

replace a certain value in a column to another

In [ ]:
# In column a, replacing 0 with 100. In column b, replacing 5 with 100 
df.replace({"a": 0, "b": 5}, 100)

In [ ]:
# Replace multipe values
df.replace([1.5, df00], [np.nan, "a"])

Conditon on Column

In [ ]:
#### check if a particular condition is True or False on the df or column

In [55]:
(tips>0).all()
(tips.total_bill>7).any()
tips.empty

False

Descriptive statistics

count, std, median, mode, abs, var, quantile, prod, cumsum, cummin, cummax, cumprod

In [ ]:
tips.describe()

In [65]:
iris[['sepal_length']].quantile([0.25,0.5,0.75])

      sepal_length
0.25           5.1
0.50           5.8
0.75           6.4

count values

In [2]:
tips['day'].value_counts()
tips.value_counts() # -> see if the rows is unique

total_bill  tip    sex     smoker  day   time    size
13.00       2.00   Female  Yes     Thur  Lunch   2       2
3.07        1.00   Female  Yes     Sat   Dinner  1       1
22.23       5.00   Male    No      Sun   Dinner  2       1
20.69       2.45   Female  No      Sat   Dinner  4       1
            5.00   Male    No      Sun   Dinner  5       1
                                                        ..
15.53       3.00   Male    Yes     Sat   Dinner  2       1
15.69       1.50   Male    Yes     Sun   Dinner  2       1
            3.00   Male    Yes     Sat   Dinner  3       1
15.77       2.23   Female  No      Sat   Dinner  2       1
50.81       10.00  Male    Yes     Sat   Dinner  3       1
Length: 243, dtype: int64

mode of column and df

In [4]:
tips['day'].mode()
tips.mode()

   total_bill  tip   sex smoker  day    time  size
0       13.42  2.0  Male     No  Sat  Dinner     2

#### Apply Function

1. Table-Wise

In [15]:
# add country
def extract_city_name(df):
    # Chicago,IL ->Chicago
    df['city'] = df['location'].str.split(',').str[0]
    return df
def city_add_type(df):
    df['city_add_type'] = df['city']+ '-' + df['type']
    return df

In [16]:
df = pd.DataFrame({'location':['Chicago,IL','Mclean,VA'],
                   'type':['Big','Middle']})

In [17]:
city_add_type(extract_city_name(df))

     location    type     city  city_add_type
0  Chicago,IL     Big  Chicago    Chicago-Big
1   Mclean,VA  Middle   Mclean  Mclean-Middle

In [19]:
df.pipe(extract_city_name).pipe(city_add_type)

     location    type     city  city_add_type
0  Chicago,IL     Big  Chicago    Chicago-Big
1   Mclean,VA  Middle   Mclean  Mclean-Middle

2. Row or column-wise function application

Apply

* default : Axis =0, act on all the ROWS in each COLUMN
* Axis 1 will act on all the COLUMNS in each ROW

In [27]:
iris[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].apply(np.mean, axis = 0)

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [7]:
def value_prod_n(series,n,x,y):
    return series*n+x-y

In [4]:
iris[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [10]:
iris[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].apply(value_prod_n, args = (3,1,8)).head()

   sepal_length  sepal_width  petal_length  petal_width
0           8.3          3.5          -2.8         -6.4
1           7.7          2.0          -2.8         -6.4
2           7.1          2.6          -3.1         -6.4
3           6.8          2.3          -2.5         -6.4
4           8.0          3.8          -2.8         -6.4

* agg (column/row) and transform(table/column)

In [17]:
iris[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].agg(["sum", "mean"], axis = 0)

      sepal_length  sepal_width  petal_length  petal_width
sum     876.500000   458.600000       563.700   179.900000
mean      5.843333     3.057333         3.758     1.199333

In [19]:
iris.transform({"sepal_length": np.abs, "sepal_length": lambda x: x + 1})
iris.transform(np.abs)

     sepal_length
0             6.1
1             5.9
2             5.7
3             5.6
4             6.0
..            ...
145           7.7
146           7.3
147           7.5
148           7.2
149           6.9

[150 rows x 1 columns]

3.Elementwise

map -> on Series  
applymap -> on DF

In [21]:
def replace(x):
    if x >10:
        return 100
    else:
        return 200

In [24]:
tips[['tip','total_bill']].applymap(replace)

     tip  total_bill
0    200         100
1    200         100
2    200         100
3    200         100
4    200         100
..   ...         ...
239  200         100
240  200         100
241  200         100
242  200         100
243  200         100

[244 rows x 2 columns]

In [23]:
tips['tip'].map(replace).head()

0    200
1    200
2    200
3    200
4    200
Name: tip, dtype: int64

#### Reorder

In [ ]:
df.reindex(["three", "two", "one"], axis="columns")
df.reindex(["c", "f", "b"], axis="index")

#### Rename

In [ ]:
s.rename(str.upper)
tips.rename({
    columns = {'a':'asf', 'b':'sge'},
    index={"a": "apple", "b": "banana", "d": "durian"}
})

#### Iteration
* Series: values
* DataFrame: column labels
* Series.items(): (index, scalar value) pairs
* DataFrame.items(): (column, Series) pairs
* DataFrame.iterrows():(index, Series) pairs

#### Sorting

1. By Index

In [ ]:
df.sort_index(ascending = False, axis = 1)
# Sort when you have multipe index and apply a function to the values WHEN IT IS being sorted (index here)
s1.sort_index(level="a", key=lambda idx: idx.str.lower())

2. By Value

In [ ]:
df.sort_values(by=["one", "two"],na_position="first")
s1.sort_values(key=lambda x: x.str.lower())

#### Data Type

In [ ]:
df/s.dtype

1. Convert

In [ ]:
s.astype()
dft[["a", "b"]].astype(np.uint8)
df.astype({"a": np.bool_, "c": np.float64})

2. Object Soft Conver

In [ ]:
df/s.infer_objects()

3. Conver 1-d OBJECT arrays

In [ ]:
to_numeric(s,errors='coerce') 
to_datetime()
to_timedelta()

## 2.Indexing and Selecting

1. loc % iloc:
    * loc is based on label and iloc is based on position/index
    * if only one paramenter in df.loc/iloc[], then row

In [ ]:
df.loc[row_indexer,column_indexer]

In [2]:
s1 = pd.Series(np.random.randn(5), index=list(range(0, 10, 2)))

In [3]:
s1.iloc[:3]

0   -2.008952
2   -0.625418
4   -2.105752
dtype: float64

In [4]:
s1.loc[:3]

0   -2.008952
2   -0.625418
dtype: float64

In [2]:
df1 = pd.DataFrame(np.random.randn(6, 4),
                   index=list(range(0, 12, 2)),
                   columns=list(range(0, 8, 2)))

In [3]:
df1

           0         2         4         6
0  -1.104238 -0.373685 -1.179784 -0.489057
2  -1.974649 -0.502268 -0.304569 -1.286465
4   1.298404 -0.714299 -0.241585  0.106115
6   1.702559 -1.100444 -0.193202  0.405503
8   1.065579  0.111578 -0.895594  0.748930
10 -0.723015 -0.760636  0.149983  1.135834

In [7]:
df1.loc[:4,:3]

          0         2
0  0.313277 -0.758827
2  0.806100  0.738918
4  0.507583 -0.319573

In [8]:
df1.iloc[:4,:3]

          0         2         4
0  0.313277 -0.758827 -1.586678
2  0.806100  0.738918 -1.455463
4  0.507583 -0.319573 -0.548141
6 -0.645263  0.530732 -0.188204

* using functions to find lable/index then using loc/iloc

In [23]:
tips.groupby(['day','time']).sum().loc[lambda df: df['total_bill']<10,:]

           total_bill  tip  size
day time
Sat Lunch         0.0  0.0     0
Sun Lunch         0.0  0.0     0

In [ ]:
#Lable to Index
df.columns.get_loc('A')
df.columns.get_indexer(['A','B'])
dfd.iloc[[0, 2], dfd.columns.get_indexer(['A', 'B'])]

2. Selecting random samples

In [ ]:
s.sample(n=3, frac=0.5,replace=False,weights = [0, 0, 0.2, 0.2, 0.2, 0.4])

In [ ]:
df4.sample(n=2, random_state=2)

In [ ]:
df3.sample(n=1, axis=1) #return a column

3. n largest/smallest:

In [ ]:
s.nsmallest(3)
df.nlargest(3, "a")
df.nsmallest(6,['a','b'])

4. by dtype

In [ ]:
df.select_dtypes(include=["number", "bool"], exclude=["unsignedinteger"])

5. Other

In [ ]:
tips[tips['day'].map(lambda x: x.startswith('S'))]

In [ ]:
df.isin()

In [ ]:
df.where

In [ ]:
df.query

In [ ]:
df.query('a in b and c < d')
df[df['b'].isin(df['a']) & (df['c'] < df['d'])]

6. Duplicates

In [ ]:
df2.drop_duplicates('a')
df3.index.duplicated()

## 3.External Files

In [ ]:
pd.read_excel()

In [ ]:
file = pd.ExcelFile('path.xlsx')
pd.read_excel(file, sheet_name = 'Sheet1')

In [ ]:
with pd.ExcelFile("path_to_file.xls") as xls:
    df1 = pd.read_excel(xls, "Sheet1")
    df2 = pd.read_excel(xls, "Sheet2")

In [ ]:
with pd.ExcelWriter("path_to_file.xlsx") as writer:
    df1.to_excel(writer, sheet_name="Sheet1")
    df2.to_excel(writer, sheet_name="Sheet2")

## 4. Merge, join, concatenate and compare

In [28]:
df1 = pd.DataFrame(
    {
         "A": ["A0", "A1", "A2", "A3"],
         "B": ["B0", "B1", "B2", "B3"],
         "C": ["C0", "C1", "C2", "C3"],
         "D": ["D0", "D1", "D2", "D3"],
    },
     index=[0, 1, 2, 3])
df4 = pd.DataFrame(
   {
         "B": ["B2", "B3", "B6", "B7"],
         "D": ["D2", "D3", "D6", "D7"],
         "F": ["F2", "F3", "F6", "F7"],
    },
   index=[2, 3, 6, 7])

In [29]:
pd.concat([df1,df1],ignore_index=False)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [79]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [80]:
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [98]:
pd.concat([df1,df4],axis = 1)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

## 5.Reshape

1. Pivot (INDEX must be UNIQUE)

In [4]:
import pandas._testing as tm


def unpivot(frame):
    N, K = frame.shape
    data = {
        "value": frame.to_numpy().ravel("F"),
        "variable": np.asarray(frame.columns).repeat(N),
        "date": np.tile(np.asarray(frame.index), K),
    }
    return pd.DataFrame(data, columns=["date", "variable", "value"])


df = unpivot(tm.makeTimeDataFrame(3))

In [5]:
df.head()

        date variable     value
0 2000-01-03        A -1.530614
1 2000-01-04        A  0.433880
2 2000-01-05        A  0.674473
3 2000-01-03        B -0.544916
4 2000-01-04        B  0.277505

In [6]:
df_pivot = df.pivot(index = 'date', columns = 'variable', values = 'value')

In [7]:
df_pivot

variable           A         B         C         D
date
2000-01-03 -1.530614 -0.544916  1.522753 -1.360645
2000-01-04  0.433880  0.277505 -0.944035  0.996266
2000-01-05  0.674473 -0.309612  0.974222 -1.852428

In [8]:
df_pivot.columns

Index(['A', 'B', 'C', 'D'], dtype='object', name='variable')

In [117]:
df_pivot.columns = df_pivot.columns + '_'+ df_pivot.columns.name

In [120]:
df_pivot.columns.name = None

In [122]:
df_pivot.reset_index()

        date  A_variable  B_variable  C_variable  D_variable
0 2000-01-03    0.439778   -1.722548   -0.111048    0.970048
1 2000-01-04   -1.537463   -1.616148   -0.839217   -0.639615
2 2000-01-05   -0.229250    0.696983    0.424941   -2.155936

2. unstack: -1 index  
    stack: +1 index

In [10]:
tips_3_index = tips.groupby( ['sex','day', 'time']).sum()

In [11]:
tips_3_index

                    total_bill     tip  size
sex    day  time
Male   Thur Lunch       561.44   89.41    73
            Dinner        0.00    0.00     0
       Fri  Lunch        34.16    5.70     5
            Dinner      164.41   21.23    16
       Sat  Lunch         0.00    0.00     0
            Dinner     1227.35  181.95   156
       Sun  Lunch         0.00    0.00     0
            Dinner     1269.46  186.78   163
Female Thur Lunch       516.11   79.42    77
            Dinner       18.78    3.00     2
       Fri  Lunch        55.76   10.98     9
            Dinner       71.55   14.05    10
       Sat  Lunch         0.00    0.00     0
            Dinner      551.05   78.45    63
       Sun  Lunch         0.00    0.00     0
            Dinner      357.70   60.61    53

In [12]:
tips_3_index.unstack()

            total_bill             tip          size
time             Lunch   Dinner  Lunch  Dinner Lunch Dinner
sex    day
Male   Thur     561.44     0.00  89.41    0.00    73      0
       Fri       34.16   164.41   5.70   21.23     5     16
       Sat        0.00  1227.35   0.00  181.95     0    156
       Sun        0.00  1269.46   0.00  186.78     0    163
Female Thur     516.11    18.78  79.42    3.00    77      2
       Fri       55.76    71.55  10.98   14.05     9     10
       Sat        0.00   551.05   0.00   78.45     0     63
       Sun        0.00   357.70   0.00   60.61     0     53

In [30]:
tips_2_indes = tips_3_index.unstack()[['tip','total_bill']]

In [33]:
tips_2_indes.columns

MultiIndex([(       'tip',  'Lunch'),
            (       'tip', 'Dinner'),
            ('total_bill',  'Lunch'),
            ('total_bill', 'Dinner')],
           names=[None, 'time'])

In [32]:
tips_2_indes.stack()

                       tip  total_bill
sex    day  time
Male   Thur Lunch    89.41      561.44
            Dinner    0.00        0.00
       Fri  Lunch     5.70       34.16
            Dinner   21.23      164.41
       Sat  Lunch     0.00        0.00
            Dinner  181.95     1227.35
       Sun  Lunch     0.00        0.00
            Dinner  186.78     1269.46
Female Thur Lunch    79.42      516.11
            Dinner    3.00       18.78
       Fri  Lunch    10.98       55.76
            Dinner   14.05       71.55
       Sat  Lunch     0.00        0.00
            Dinner   78.45      551.05
       Sun  Lunch     0.00        0.00
            Dinner   60.61      357.70

3. Melt : wide to long

In [34]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [53]:
tips.melt(id_vars = ['sex','smoker','day'], value_vars = ['total_bill','tip'])

        sex smoker   day    variable  value
0    Female     No   Sun  total_bill  16.99
1      Male     No   Sun  total_bill  10.34
2      Male     No   Sun  total_bill  21.01
3      Male     No   Sun  total_bill  23.68
4    Female     No   Sun  total_bill  24.59
..      ...    ...   ...         ...    ...
483    Male     No   Sat         tip   5.92
484  Female    Yes   Sat         tip   2.00
485    Male    Yes   Sat         tip   2.00
486    Male     No   Sat         tip   1.75
487  Female     No  Thur         tip   3.00

[488 rows x 5 columns]

4. pivot_table (with the function to aggregate)

In [39]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [45]:
a = tips.groupby(['day','sex','time','smoker'])[['tip']].mean().unstack()

In [46]:
a.columns

MultiIndex([('tip', 'Yes'),
            ('tip',  'No')],
           names=[None, 'smoker'])

In [48]:
b = tips.pivot_table(index = ['day','sex','time'], columns = 'smoker', values = 'tip', aggfunc = np.mean)

In [49]:
b.columns

CategoricalIndex(['Yes', 'No'], categories=['Yes', 'No'], ordered=False, name='smoker', dtype='category')

## 6. Working with Text Data

### methods

Change

In [ ]:
lower()/upper()
strip()
extract()
capitalize()
swapcase()

Split

In [ ]:
s.str.split('x').str[0]
s.str.split('x', expand = True, n = 1)

Replace

In [ ]:
replace('x',regex = True)

Concatination

In [ ]:
s.str.cat(sep=",")

In [232]:
tips.sex.str.cat(tips.time, sep = '-')

0      Female-Dinner
1        Male-Dinner
2        Male-Dinner
3        Male-Dinner
4      Female-Dinner
           ...
239      Male-Dinner
240    Female-Dinner
241      Male-Dinner
242      Male-Dinner
243    Female-Dinner
Name: sex, Length: 244, dtype: object

In [ ]:
startswith()/endswith()
len()

## 7.Missing Values

In [ ]:
isna()/notna()

In [ ]:
aggregate by not skip na will return nan

In [245]:
pd.Series([3,2,np.nan]).mean(skipna=False)

nan

In [ ]:
df.fillna(df.mean()["B":"C"])

In [ ]:
.dropna()# axis = 0 drop rows, axis =1 drop column

## 8. Date Time

Create date range

In [6]:
pd.Series(pd.date_range("20130101", periods=4, freq="D"))

0   2013-01-01
1   2013-01-02
2   2013-01-03
3   2013-01-04
dtype: datetime64[ns]

In [7]:
pd.Series(pd.timedelta_range("1 day 00:00:05", periods=4, freq="s"))

0   1 days 00:00:05
1   1 days 00:00:06
2   1 days 00:00:07
3   1 days 00:00:08
dtype: timedelta64[ns]

For SERIES with datetime64[ns] as type
* get date part: s.dt.date / day / year / hour / components
* set location: s.dt.tz_localize("UTC")
* conver location: s.dt.tz_convert("US/Eastern")
* change format Series.dt.strftime()

In [ ]:
pd.to_datetime("2010/11/12", format="%Y/%m/%d")
pd.Timestamp("2018-01-05")

In [255]:
ts = pd.Series(pd.date_range("1/1/2011", freq="M", periods=3))

In [257]:
ts+ pd.DateOffset(3)

0   2011-02-03
1   2011-03-03
2   2011-04-03
dtype: datetime64[ns]

In [256]:
ts.apply(lambda x: x + pd.DateOffset(3))

0   2011-02-03
1   2011-03-03
2   2011-04-03
dtype: datetime64[ns]

In [ ]:
#group by
#sort
#window function
#    rank
#    dense_rank
#    running sum
#substr
#concat string
#datediff
#dateadd
#filter

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
#consecutive 5 days in python

In [21]:
df = pd.DataFrame({'id':[7,1,7,7,7,7,7,1,7],
              'login_date': ['2020-05-30','2020-05-30','2020-05-31',
                    '2020-06-01','2020-06-02','2020-06-02',
                    '2020-06-03','2020-06-07','2020-06-10']})

In [22]:
df

   id  login_date
0   7  2020-05-30
1   1  2020-05-30
2   7  2020-05-31
3   7  2020-06-01
4   7  2020-06-02
5   7  2020-06-02
6   7  2020-06-03
7   1  2020-06-07
8   7  2020-06-10

In [28]:
df['login_date'] = pd.to_datetime(df['login_date'],format = '%Y-%m-%d')

In [38]:
df = df.sort_values(by = ['id','login_date'],ascending=True).reset_index(drop = True)

In [41]:
df['shift_4'] = df.groupby('id')['login_date'].shift(4)

In [52]:
df[df['shift_4'].notnull()]['id'].drop_duplicates()

6    7
Name: id, dtype: int64